jMeter/GRPC Request YARP FAT.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group Yarp">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">3</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import org.apache.commons.io.FileUtils

// Чтение файла
def filePath = &quot;/home/niao/Загрузки/apache-jmeter-5.6.3/request-payload_fat.json&quot;
def file = new File(filePath)
def requestBody = FileUtils.readFileToString(file, &quot;UTF-8&quot;)

// Сохраняем в переменную
vars.put(&quot;grpc_request_body&quot;, requestBody)</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request YARP">
          <stringProp name="GRPCSampler.protoFolder">/home/niao/Загрузки/ghz-linux-x86_64</stringProp>
          <stringProp name="GRPCSampler.libFolder">/home/niao/Загрузки/ghz-linux-x86_64</stringProp>
          <stringProp name="GRPCSampler.metadata">{&quot;SessionID&quot;: &quot;test-session-1&quot;}</stringProp>
          <stringProp name="GRPCSampler.host">192.168.232.95</stringProp>
          <stringProp name="GRPCSampler.port">5010</stringProp>
          <stringProp name="GRPCSampler.fullMethod">fileservice.FileService/SaveFileUnary</stringProp>
          <stringProp name="GRPCSampler.deadline">150000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">true</boolProp>
          <stringProp name="GRPCSampler.channelAwaitTermination">1000</stringProp>
          <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
          <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
          <stringProp name="GRPCSampler.requestJson">${grpc_request_body}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
        <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="JSR223 Assertion" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import groovy.json.JsonSlurper

// Получаем тело ответа как строку
def response = prev.getResponseDataAsString()

// Парсим JSON
def json = new JsonSlurper().parseText(response)

// Проверяем, есть ли поле &quot;success&quot; и равно ли оно true
if (json.success == true) {
    // Явно помечаем успех (хотя JMeter делает это по умолчанию)
    AssertionResult.setFailure(false)
} else {
    // Помечаем ошибку, если &quot;success&quot;: true не найден
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&apos;&quot;success&quot;: true not found in JSON response&apos;)
}
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Assertion>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>